EDT/УТ/src/Documents/мгНачисленияПоСдельнойОплате/мгНачисленияПоСдельнойОплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгНачисленияПоСдельнойОплате</name>
  <registerRecords>AccumulationRegister.мгЗарплатаНачисления</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаПодъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПоФиксТарифу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/мгЗарплатаНачисления/мгЗарплатаНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>мгЗарплатаНачисления</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНачисления</name>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Catalogs/мгНачисленияУдержания/мгНачисленияУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мгНачисленияУдержания</name>
  <predefined>
    <items>
      <name>ВСчетЗП</name>
      <description>В счет ЗП</description>
    </items>
    <items>
      <name>ВыданАвансИЗП</name>
      <description>Выдан аванс и ЗП</description>
    </items>
    <items>
      <name>Депримирование</name>
      <description>Депримирование</description>
    </items>
    <items>
      <name>ДисциплинарныеВзыскания</name>
      <description>Дисциплинарные взыскания</description>
    </items>
    <items>
      <name>ИсполнительныйЛист</name>
      <description>Исполнительный лист</description>
    </items>
    <items>
      <name>МагистральСПБ</name>
      <description>Магистраль СПБ</description>
    </items>
    <items>
      <name>МатериальныйУщерб</name>
      <description>Материальный ущерб</description>
    </items>
    <items>
      <name>НадбавкиПоЗаказам</name>
      <description>Надбавки по заказам</description>
    </items>
    <items>
      <name>НачислениеЗаПодъем</name>
      <description>Начисление за подъем</description>
    </items>
    <items>
      <name>НачислениеОсновное</name>
      <description>Начисление основное</description>
    </items>
    <items>
      <name>НочнойВодитель</name>
      <description>Ночной водитель</description>
    </items>
    <items>
      <name>ОтпускныеБольничные</name>
      <description>Отпускные больничные</description>
    </items>
    <items>
      <name>ПодработкаНаСкладе</name>
      <description>Подработка на складе</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Премия</description>
    </items>
    <items>
      <name>Пропуска</name>
      <description>Пропуска</description>
    </items>
    <items>
      <name>ТарифПоКонтрагенту</name>
      <description>Тариф по контрагенту</description>
    </items>
    <items>
      <name>ШтрафыПДД</name>
      <description>Штрафы ПДД</description>
    </items>
  </predefined>
  <attributes>
    <name>НачислениеУдержание</name>
    <type>
      <types>EnumRef.мгНачислениеУдержание</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/мгНачисленияПоСдельнойОплате/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр мгУчетЗарплаты 
	//Движения.мгУчетЗарплаты.Записывать = Истина;
	//Движения.мгУчетЗарплаты.Очистить();
	//Для Каждого ТекСтрокаДанные Из Данные Цикл
	//	Движение = Движения.мгУчетЗарплаты.Добавить();
	//	Движение.Период = ПериодРегистрации;
	//	Движение.Организация = Организация;
	//	Движение.Терминал = Терминал;
	//	Движение.НачислениеУдержание = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НачислениеСдельнойОплаты");
	//	Движение.Сотрудник = ТекСтрокаДанные.Сотрудник;
	//	Движение.Сумма = ТекСтрокаДанные.СуммаОплаты;
	//КонецЦикла;

	Движения.мгЗарплатаНачисления.Записывать = Истина;
	Движения.мгЗарплатаНачисления.Очистить();
	Для каждого ТекСтрокаДанные Из Данные Цикл
		
		Если ЗначениеЗаполнено(ТекСтрокаДанные.СуммаОплаты) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ПериодРегистрации;
			Движение.Организация = ТекСтрокаДанные.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НачислениеОсновное");
			Движение.Сотрудник = ТекСтрокаДанные.Сотрудник;
			Движение.Тариф = ТекСтрокаДанные.СуммаОплаты;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрокаДанные.СуммаЗаПодъем) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ПериодРегистрации;
			Движение.Организация = ТекСтрокаДанные.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НачислениеЗаПодъем");
			Движение.Сотрудник = ТекСтрокаДанные.Сотрудник;
			Движение.Тариф = ТекСтрокаДанные.СуммаЗаПодъем;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрокаДанные.СуммаПоФиксТарифу) Тогда
			Движение = Движения.мгЗарплатаНачисления.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ПериодРегистрации;
			Движение.Организация = ТекСтрокаДанные.Организация;
			Движение.Терминал = Терминал;
			Движение.ВидНачисления = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.ТарифПоКонтрагенту");
			Движение.Сотрудник = ТекСтрокаДанные.Сотрудник;
			Движение.Тариф = ТекСтрокаДанные.СуммаПоФиксТарифу;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
